/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   map.h                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seojo <seojo@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/13 13:59:49 by seojo             #+#    #+#             */
/*   Updated: 2023/01/13 14:54:09 by seojo            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef MAP_H
# define MAP_H

typedef enum e_map_err	t_map_err;

enum e_map_err
{
	NO = 0,
	SO,
	WE,
	EA,
	F,
	C
};
// 각 방향당 파일 하나씩 있는지,  파일명.확장자, 존재유무, 권한
// 색상 초과-미만, 어떤 색상이 없는지 있는지.
// error 출력 이후에 다른 없는 부분들까지 출력

void	print_map_argument_err(t_map_err err_num);
#endif
